<a href="https://colab.research.google.com/github/YahiaML/SQL_Udacity_Course/blob/main/Unit_1_Basic_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import sqlite3
import pandas as pd

In [9]:
db = sqlite3.connect('/content/parch_and_posey.db')

# **L_1:** SELECT FROM

**SELECT:** choose the columns that you want

**FROM:** choose the table that contains the columns that you want

In [10]:
SQL_code = '''

SELECT * 
FROM accounts
LIMIT 15;
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

(1001, 'Walmart', 'www.walmart.com', 40.23849561, -75.10329704, 'Tamara Tuma', 321500)
(1011, 'Exxon Mobil', 'www.exxonmobil.com', 41.1691563, -73.84937379, 'Sung Shields', 321510)
(1021, 'Apple', 'www.apple.com', 42.29049481, -76.08400942, 'Jodee Lupo', 321520)
(1031, 'Berkshire Hathaway', 'www.berkshirehathaway.com', 40.94902131, -75.76389759, 'Serafina Banda', 321530)
(1041, 'McKesson', 'www.mckesson.com', 42.21709326, -75.28499823, 'Angeles Crusoe', 321540)
(1051, 'UnitedHealth Group', 'www.unitedhealthgroup.com', 40.08792542, -75.57569396, 'Savanna Gayman', 321550)
(1061, 'CVS Health', 'www.cvshealth.com', 41.46779585, -73.76763638, 'Anabel Haskell', 321560)
(1071, 'General Motors', 'www.gm.com', 40.80551762, -76.7101814, 'Barrie Omeara', 321570)
(1081, 'Ford Motor', 'www.ford.com', 41.113942, -75.85422452, 'Kym Hagerman', 321580)
(1091, 'AT&ampT', 'www.att.com', 42.4974627, -74.90271225, 'Jamel Mosqueda', 321590)
(1101, 'General Electric', 'www.ge.com', 41.1697121, -77.29713174, 'Parker Hoggan', 321600)
(1111, 'AmerisourceBergen', 'www.amerisourcebergen.com', 41.91146908, -74.4762077, 'Tuan Trainer', 321610)
(1121, 'Verizon', 'www.verizon.com', 41.3414106, -75.77193559, 'Chantell Drescher', 321620)
(1131, 'Chevron', 'www.chevron.com', 42.6119413, -76.36123105, 'Paige Bartos', 321630)
(1141, 'Costco', 'www.costco.com', 42.26304566, -74.80916921, 'Dominique Favela', 321640)

# **L_2:** LIMIT
Only show the first x rows

In [11]:
sql_code = db.execute('''
SELECT occurred_at, account_id, channel
FROM web_events
LIMIT 15;
''')

# print output as a table (data frame)
data = []
for row in sql_code:
  data.append(list(row))
df= pd.DataFrame(data,columns=["occurred_at","account_id", "channel"])  # inset columns names that you want
df

            occurred_at  account_id channel
0   2015-10-06 17:13:58        1001  direct
1   2015-11-05 03:08:26        1001  direct
2   2015-12-04 03:57:24        1001  direct
3   2016-01-02 00:55:03        1001  direct
4   2016-02-01 19:02:33        1001  direct
5   2016-03-02 15:15:22        1001  direct
6   2016-04-01 10:58:55        1001  direct
7   2016-05-01 15:26:44        1001  direct
8   2016-05-31 20:53:47        1001  direct
9   2016-06-30 12:09:45        1001  direct
10  2016-07-30 03:06:26        1001  direct
11  2016-08-28 06:42:42        1001  direct
12  2016-09-26 23:14:59        1001  direct
13  2016-10-26 20:21:09        1001  direct
14  2016-11-25 22:52:29        1001  direct

# **L_3:** ORDER BY & ORDER BY column_X DESC
**ORDER BY:** Used to arrange outputs ascendingly according to column X

**ORDER BY column_X DESC:** Used to arrange outputs descendingly according to column X

In [12]:
SQL_code = '''
SELECT id, occurred_at, total_amt_usd
FROM orders 
ORDER BY occurred_at
LIMIT 10
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

(5786, '2013-12-04 04:22:44', 627.48)
(2415, '2013-12-04 04:45:54', 2646.77)
(4108, '2013-12-04 04:53:25', 2709.62)
(4489, '2013-12-05 20:29:16', 277.13)
(287, '2013-12-05 20:33:56', 3001.85)
(1946, '2013-12-06 02:13:20', 2802.9)
(6197, '2013-12-06 12:55:22', 7009.18)
(3122, '2013-12-06 12:57:41', 1992.13)
(6078, '2013-12-06 13:14:47', 6680.06)
(2932, '2013-12-06 13:17:25', 2075.94)

In [17]:
SQL_code = '''
SELECT id, occurred_at, total_amt_usd
FROM orders 
ORDER BY total_amt_usd DESC
LIMIT 5
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

(4016, '2016-12-26 08:53:24', 232207.07)
(3892, '2016-06-24 13:32:55', 112875.18)
(3963, '2015-03-30 00:05:30', 107533.55)
(5791, '2014-10-24 12:06:22', 95005.82)
(3778, '2016-07-17 14:50:43', 93547.84)

In [15]:
# we can order by more than 1 column with respect to there order in the ORDER BY query
SQL_code = '''
SELECT id, account_id, total_amt_usd
FROM orders 
ORDER BY account_id, total_amt_usd DESC
LIMIT 5
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

(4308, 1001, 9426.71)
(4309, 1001, 9230.67)
(4316, 1001, 9134.31)
(4317, 1001, 8963.91)
(4314, 1001, 8863.24)

# **L_4:** WHERE
Used to extract only those rows that fulfill a specified condition

.> (greater than), < (less than), >= (greater than or equal to), <= (less than or equal to), = (equal to), != (not equal to)

In [19]:
SQL_code = '''
SELECT *
FROM orders 
WHERE gloss_amt_usd >= 1000
LIMIT 5
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

(14, 1001, '2016-10-26 20:31:30', 97, 143, 54, 294, 484.03, 1071.07, 438.48, 1993.58)
(62, 1091, '2014-10-13 12:12:55', 146, 196, 3, 345, 728.54, 1468.04, 24.36, 2220.94)
(88, 1101, '2015-06-24 13:08:15', 182, 339, 17, 538, 908.18, 2539.11, 138.04, 3585.33)
(121, 1131, '2016-08-10 23:47:41', 273, 134, 0, 407, 1362.27, 1003.66, 0, 2365.93)
(129, 1141, '2016-12-21 15:52:58', 143, 1045, 2157, 3345, 713.57, 7827.05, 17514.84, 26055.46)

In [20]:
SQL_code = '''
SELECT name, website, primary_poc
FROM accounts 
WHERE name = 'Exxon Mobil'
'''
# strings must be placed in single quotes ( ' ) NOT double quotes ( " )

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

('Exxon Mobil', 'www.exxonmobil.com', 'Sung Shields')

# **L_5:** Arithmetic Operations (+, -, *, / )
Creat a new column that is a combination of existing columns

In [22]:
SQL_code = '''
SELECT id, account_id, standard_amt_usd,standard_qty, standard_amt_usd/standard_qty AS unit_price
FROM orders 
LIMIT 10
'''

code_execution = db.execute(SQL_code)

data = []
for row in code_execution:
  data.append(list(row))
df= pd.DataFrame(data,columns=["id","account_id", "standard_amt_usd", "standard_qty", "unit_price" ])  # inset columns names that you want
df

   id  account_id  standard_amt_usd  standard_qty  unit_price
0   1        1001            613.77           123        4.99
1   2        1001            948.10           190        4.99
2   3        1001            424.15            85        4.99
3   4        1001            718.56           144        4.99
4   5        1001            538.92           108        4.99
5   6        1001            513.97           103        4.99
6   7        1001            503.99           101        4.99
7   8        1001            474.05            95        4.99
8   9        1001            454.09            91        4.99
9  10        1001            469.06            94        4.99

In [23]:
SQL_code = '''
SELECT id, account_id, poster_amt_usd/(standard_amt_usd + gloss_amt_usd + poster_amt_usd) AS post_per
FROM orders
LIMIT 10;
'''

code_execution = db.execute(SQL_code)

data = []
for row in code_execution:
  data.append(list(row))
df= pd.DataFrame(data,columns=["id","account_id", "post_per"])  # inset columns names that you want
df

   id  account_id  post_per
0   1        1001  0.200199
1   2        1001  0.269402
2   3        1001  0.000000
3   4        1001  0.000000
4   5        1001  0.231177
5   6        1001  0.349984
6   7        1001  0.498625
7   8        1001  0.597466
8   9        1001  0.237373
9  10        1001  0.073939

# **L_6:** LIKE & NOT LIKE

**LIKE:** Used in a WHERE clause to search for a specified pattern in a column.

**NOT LIKE:** Used in a WHERE clause to avoid a specified pattern in a column.

There are two wildcards often used in conjunction with the LIKE operator:

 The percent sign (%) represents any number of characters

 The underscore sign (_) represents one, single character

In [25]:
# "X_charecter%" : Starts with X_charecter
SQL_code = '''
SELECT name
FROM accounts 
WHERE name LIKE 'C%'
LIMIT 5
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

('CVS Health',)
('Chevron',)
('Costco',)
('Cardinal Health',)
('Citigroup',)

In [26]:
# "%X_charecter%" : has X_charecter in it
SQL_code = '''
SELECT name
FROM accounts 
WHERE name LIKE '%one%'
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

('Honeywell International',)
('INTL FCStone',)
('Capital One Financial',)
('AutoZone',)
('Oneok',)

In [28]:
# "%X_charecter" : Ends with X_charecter
SQL_code = '''
SELECT name
FROM accounts 
WHERE name LIKE '%s'
LIMIT 5
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

('General Motors',)
('United Technologies',)
("Lowe's",)
('UPS',)
('Cisco Systems',)

In [31]:
SQL_code = '''
SELECT name
FROM accounts 
WHERE name NOT LIKE '%one%'
LIMIT 5
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

('Walmart',)
('Exxon Mobil',)
('Apple',)
('Berkshire Hathaway',)
('McKesson',)

# **L_7:** IN & NOT IN

**IN:** Used to specify multiple values in a WHERE clause.

**NOT IN:** Used to avoid multiple values in a WHERE clause.

In [29]:
SQL_code = '''
SELECT name, primary_poc, sales_rep_id
FROM accounts
WHERE name IN ('Walmart', 'Target', 'Nordstrom')
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

('Walmart', 'Tamara Tuma', 321500)
('Target', 'Luba Streett', 321660)
('Nordstrom', 'Yan Crater', 321820)

In [32]:
SQL_code = '''
SELECT name, primary_poc, sales_rep_id
FROM accounts
WHERE name NOT IN ('Walmart', 'Target', 'Nordstrom')
LIMIT 5
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

('Exxon Mobil', 'Sung Shields', 321510)
('Apple', 'Jodee Lupo', 321520)
('Berkshire Hathaway', 'Serafina Banda', 321530)
('McKesson', 'Angeles Crusoe', 321540)
('UnitedHealth Group', 'Savanna Gayman', 321550)

# **L_8:** AND & BETWEEN

**AND:** Shows the row if all the conditions separated by AND are TRUE

**BETWEEN:** elects values within a given range. The values can be numbers, text, or dates

$NOTE:$ BETWEEN operator included the begin and end values

In [33]:
SQL_code = '''
SELECT id, standard_qty, poster_qty, gloss_qty
FROM orders 
WHERE standard_qty > 1000 AND poster_qty = 0 AND gloss_qty = 0
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

(2613, 1171, 0, 0)
(3260, 1552, 0, 0)

In [34]:
SQL_code = '''
SELECT occurred_at, gloss_qty
FROM orders   
WHERE gloss_qty BETWEEN 24 AND 29
LIMIT 5
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

('2016-02-01 19:27:27', 29)
('2016-03-02 15:29:32', 24)
('2016-10-14 23:54:21', 28)
('2015-08-09 18:29:20', 24)
('2016-02-01 20:00:37', 26)

In [36]:
SQL_code = '''
SELECT *
FROM web_events    
WHERE channel IN ('organic','adwords') AND occurred_at BETWEEN '2016-01-01' AND '2016-12-30'
ORDER BY occurred_at 
LIMIT 10
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

(4399, 1001, '2016-01-01 15:45:54', 'adwords')
(5581, 1831, '2016-01-02 21:27:39', 'organic')
(8775, 4281, '2016-01-04 22:51:01', 'adwords')
(6567, 2541, '2016-01-06 00:15:28', 'organic')
(7846, 3471, '2016-01-06 08:23:05', 'adwords')
(5641, 1851, '2016-01-06 13:37:28', 'adwords')
(6307, 2351, '2016-01-08 07:35:24', 'adwords')
(8372, 4031, '2016-01-08 11:04:04', 'adwords')
(7787, 3421, '2016-01-09 09:37:19', 'organic')
(8753, 4241, '2016-01-09 16:20:50', 'organic')

In [37]:
SQL_code = '''
SELECT *
FROM web_events    
WHERE (channel = 'organic' OR channel = 'adwords') AND occurred_at BETWEEN '2016-01-01' AND '2016-12-30'
ORDER BY occurred_at 
LIMIT 10
'''

code_execution = db.execute(SQL_code)

for row in code_execution:
  print(row)

(4399, 1001, '2016-01-01 15:45:54', 'adwords')
(5581, 1831, '2016-01-02 21:27:39', 'organic')
(8775, 4281, '2016-01-04 22:51:01', 'adwords')
(6567, 2541, '2016-01-06 00:15:28', 'organic')
(7846, 3471, '2016-01-06 08:23:05', 'adwords')
(5641, 1851, '2016-01-06 13:37:28', 'adwords')
(6307, 2351, '2016-01-08 07:35:24', 'adwords')
(8372, 4031, '2016-01-08 11:04:04', 'adwords')
(7787, 3421, '2016-01-09 09:37:19', 'organic')
(8753, 4241, '2016-01-09 16:20:50', 'organic')